# IS362_Week 7

In [37]:
import pandas as pd
import numpy as np

I created Movies.csv file in Excel and then I loaded the
information into a pandas dataframe

In [38]:
movies = pd.read_csv("Movies.csv")
movies

  Students  Creed2  IT  Bohemian_Rhapsody  Fantastic_beasts2  Aquaman  Venom
0     Mike       3   3                  4                  4        5      4
1   Andrey       2   4                  4                  4        4      3
2     Nick       4   3                  0                  3        4      4
3     Kate       0   3                  5                  4        0      3
4  Kristin       2   0                  4                  0        5      3
5   Evelyn       3   3                  0                  4        5      0

I found average ratings for each movie

In [45]:
movies.mean(axis=0)

Creed2               2.333333
IT                   2.666667
Bohemian_Rhapsody    2.833333
Fantastic_beasts2    3.166667
Aquaman              3.833333
Venom                2.833333
dtype: float64

I found average ratings for each user

In [41]:
movies = movies.set_index('Students')
movies.mean(axis=1)

Students
Mike       3.833333
Andrey     3.500000
Nick       3.000000
Kate       2.500000
Kristin    2.333333
Evelyn     2.500000
dtype: float64

I created a new pandas dataframe, with normalized ratings for each user

In [42]:
norm_movies = (movies - movies.min()) / (movies.max() - movies.min())
norm_movies

          Creed2    IT  Bohemian_Rhapsody  Fantastic_beasts2  Aquaman  Venom
Students
Mike        0.75  0.75                0.8               1.00      1.0   1.00
Andrey      0.50  1.00                0.8               1.00      0.8   0.75
Nick        1.00  0.75                0.0               0.75      0.8   1.00
Kate        0.00  0.75                1.0               1.00      0.0   0.75
Kristin     0.50  0.00                0.8               0.00      1.0   0.75
Evelyn      0.75  0.75                0.0               1.00      1.0   0.00

And again I found average ratings for each user

In [35]:
norm_movies_mean = norm_movies.mean(axis=1)
norm_movies_mean

Students
Mike       0.883333
Andrey     0.808333
Nick       0.716667
Kate       0.583333
Kristin    0.508333
Evelyn     0.583333
dtype: float64

And again I found average ratings for each movie

In [43]:
norm_movies_mean = norm_movies.mean(axis=0)
norm_movies_mean

Creed2               0.583333
IT                   0.666667
Bohemian_Rhapsody    0.566667
Fantastic_beasts2    0.791667
Aquaman              0.766667
Venom                0.708333
dtype: float64

In our assignment we were trying to get more linear format with normalized ratings for each user. Data is more visual and better for analyzing. At the same time it lower some of the numbers for favorit movies, and we got absolutely new ranks of average retings for each movie.

Extra credit: Standardization

In [44]:
st_movies = (movies - movies.mean()) / (movies.std())
st_movies

,Creed2,IT,Bohemian_Rhapsody,Fantastic_beasts2,Aquaman,Venom
Students,,,,,,
Mike,0.487950,0.243975,0.523497,0.520156,0.601130,0.792594
Andrey,-0.243975,0.975900,0.523497,0.520156,0.085876,0.113228
Nick,1.219875,0.243975,-1.271350,-0.104031,0.085876,0.792594
Kate,-1.707825,0.243975,0.972209,0.520156,-1.975140,0.113228
Kristin,-0.243975,-1.951800,0.523497,-1.976595,0.601130,0.113228
Evelyn,0.487950,0.243975,-1.271350,0.520156,0.601130,-1.924871

I found average ratings for each user

In [46]:
st_movies.mean(axis=1)

Students
Mike       0.528217
Andrey     0.329114
Nick       0.161156
Kate      -0.305566
Kristin   -0.489086
Evelyn    -0.223835
dtype: float64

I found average ratings for each user

In [47]:
st_movies.mean(axis=0)

Creed2              -9.251859e-17
IT                   7.401487e-17
Bohemian_Rhapsody   -1.110223e-16
Fantastic_beasts2    1.480297e-16
Aquaman             -3.700743e-17
Venom               -7.401487e-17
dtype: float64